---
layout: post
title:  "Laser Dodge 게임 공유"
date:   2018-11-22
---

전에 올렸던 개발중이었던 게임인데 SW페스티벌 끝나고 한 번 올려봅니다.
<br>
원래 타대생 친구랑 같이 만들려고 했는데 어쩌다보니 혼자 다 만들었네요(그래서 퀄이;)
<br>
암튼 시험기간에 만들다가 시험 똥망 게임은 만들어 놓고 보니 노잼이어서 똥망 ㅠㅠ;
<br>
노잼이지만 다 올리는 분위기길래 올려봅니다(피드백 환영)
<br>
아 PC버전하고 모바일 버전 두개 만들었음
<br>
근데 모바일버전은 갤s8 기준으로 만들어서 다른 폰에서 해상도 이상할수도 있어요 (공부를 급하게 해서 아직 못고침)
<br>
암튼 PC버전은 <a href="https://drive.google.com/open?id=1C9_Ap9z-8YzTJJC5CL3CvixL_B1jYexE">레이저닷지PC</a>
<br>
모바일 버전은 <a href="https://drive.google.com/open?id=1QafOqYtCGD1wRbLKbndSSRGMUAGupGKM">레이저닷지 모바일</a>
<br>
룰 간단하게 설명 드리자면 레이저가 활성화 될 때 안맞도록 피하면 됩니다.
<br>
레이저는 움직이다가 멈추고 일정시간(일정한 범위 내의 랜덤한 시간)이후에 활성화가 됩니다.
<br>
그래서 플레이어는 레이저가 멈출때만 조심하면 되는데, 나중에 레이저가 하나씩 추가되서 멈춘거 보고도 다른거 신경쓰다가 모를거에요 아마 ㅋㅋ..(매우 헷갈림)
<br>
그리고 나중에 생성되는 레이저는 플레이어를 따라가는 유도 레이저인데, 게임은 당연히 갈수록 어려워집니다.
<br>
다른거 궁금한 거 있으면 msh0614@khu.ac.kr 로 메일 보내주세요
